tutorials/lagrangian/reactingParcelFilmFoam/splashPanel/constant/surfaceFilmProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      SurfaceFilmProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//surfaceFilmModel kinematicSingleLayer;
surfaceFilmModel thermoSingleLayer;

regionName      wallFilmRegion;

active          true;

kinematicSingleLayerCoeffs
{
    thermoModel constant;
    rho0        rho0 [1 -3 0 0 0] 1000;
    mu0         mu0 [1 -1 -1 0 0] 1e-3;
    sigma0      sigma0 [1 0 -2 0 0] 0.07;

    Cf          0.005;

    injectionModels ();
}


thermoSingleLayerCoeffs
{
    thermoModel singleComponent;
    liquid      H2O;

    Cf          0.005;

    injectionModels
    ();

    phaseChangeModel none;

    radiationModel none;

    upperSurfaceModels
    {
        heatTransferModel constant;
        constantCoeffs
        {
            c0                1e-8;
        }
    }

    lowerSurfaceModels
    {
        heatTransferModel constant;
        constantCoeffs
        {
            c0                1e-8;
        }
    }
}
